app/controllers/customer/events_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]
SELECT "events".* FROM "events" INNER JOIN "participants" ON "events"."id" = "participants"."event_id" WHERE "participants"."user_id" = $1 AND "events"."id" = $2 ORDER BY "events"."id" DESC LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def cancel
    Current.user.events.where(@event.id).delete!

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def exists
    @event = params[:id].nil? ? Event.find_by(title: params[:title]) : Event.find(params[:id])