app/controllers/customer/events_controller.rb

DELETE FROM "participants" WHERE "participants"."id" = $1  [["id", 1]]
SELECT "participants".* FROM "participants" WHERE "participants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def cancel
    Participant.find_by(id: @event.id).delete