app/controllers/customer/sessions_controller.rb

  def exists
    @user = User.find_by(email: user_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "pradeep@gkmit.co"], ["LIMIT", 1]]