app/controllers/admin/events_controller.rb

  def exists
    @event = params[:id].nil? ? Event.find_by(title: params[:title]) : Event.find(params[:id])
    render json: { error: 'Event not found' }, status: :not_found unless @event.present?
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]