app/controllers/admin/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "prdpchauhan4@gmail.com"], ["LIMIT", 1]]
---
  def exists
    @user = User.find_by(email: user_params[:email])