app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users"
---
  def list
    users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def exists
    @user = params[:id].nil? ? User.find_by(reset_password_token: params[:reset_password_token]) : User.find(params[:id])