app/presenters/event_presenter.rb

SELECT COUNT(*) FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = $1  [["event_id", 17]]
---
  def _show(options = {})
    response = {
      id: event.id,
      title: event.title,
      description: event.description,
      address: event.address,
      city: event.city,
      state: event.state,
      organizor: event.organizor,
      start_date: event.start_date,
      end_date: event.end_date,
      seat_capacity: event.seat_capacity,
      attendee: event.object.users.size