app/forms/auth_token_form.rb

  def unique_token
    errors.add(:token, :taken) if AuthToken.where(token: token).where.not(id: id).any?
---
SELECT 1 AS one FROM "auth_tokens" WHERE "auth_tokens"."token" = $1 AND "auth_tokens"."id" IS NOT NULL LIMIT $2  [["token", "Bf4MI_VQ5qI"], ["LIMIT", 1]]