app/forms/user_form.rb

  def unique_email_address
    errors.add(:email, :taken) if User.where(email: email).where.not(id: id).any?
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 AND "users"."id" != $2 LIMIT $3  [["email", "pradeep1@gkmit.co"], ["id", 9], ["LIMIT", 1]]

  def initialize(option = {}, id = nil)
    @object = id.nil? ? User.new : User.find(id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]