app/controllers/application_controller.rb

  def authenticate_token
    @auth_token = AuthToken.find_by(token: request.headers['Authorization'])
---
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = $1 LIMIT $2  [["token", "Bf4MI_VQ5qI"], ["LIMIT", 1]]

  def delete_expired_token
    return unless @auth_token.expired?

    @auth_token.delete
---
DELETE FROM "auth_tokens" WHERE "auth_tokens"."id" = $1  [["id", 1]]

  def current_user
    Current.user = AuthToken.find_by(token: request.headers['Authorization']).user
---
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = $1 LIMIT $2  [["token", "Bf4MI_VQ5qI"], ["LIMIT", 1]]