app/models/event.rb

INSERT INTO "participants" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["event_id", 1], ["created_at", "2020-05-17 13:52:54.601064"], ["updated_at", "2020-05-17 13:52:54.601064"]]
---
  def add_participant
    Participant.create!(user_id: Current.user.id, event_id: self.id)

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def cancel
    Current.user.events.where(id: self.id).delete!